{"class_name": "Functional", "config": {"name": "functional_89", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 63], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_45"}, "name": "input_45", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_132", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_132", "inbound_nodes": [[["input_45", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_88", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_88", "inbound_nodes": [[["dense_132", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_88", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_88", "inbound_nodes": [[["batch_normalization_88", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_133", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_133", "inbound_nodes": [[["activation_88", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_89", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_89", "inbound_nodes": [[["dense_133", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_89", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_89", "inbound_nodes": [[["batch_normalization_89", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_44", "trainable": true, "dtype": "float32"}, "name": "add_44", "inbound_nodes": [[["activation_89", 0, 0, {}], ["activation_88", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_88", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_88", "inbound_nodes": [[["add_44", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "encoder", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder", "inbound_nodes": [[["dropout_88", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_89", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_89", "inbound_nodes": [[["encoder", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_134", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_134", "inbound_nodes": [[["dropout_89", 0, 0, {}]]]}], "input_layers": [["input_45", 0, 0]], "output_layers": [["dense_134", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}