{"class_name": "Functional", "config": {"name": "functional_169", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_85"}, "name": "input_85", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_252", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_252", "inbound_nodes": [[["input_85", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_168", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_168", "inbound_nodes": [[["dense_252", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_168", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_168", "inbound_nodes": [[["batch_normalization_168", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_253", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_253", "inbound_nodes": [[["activation_168", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_169", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_169", "inbound_nodes": [[["dense_253", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_169", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_169", "inbound_nodes": [[["batch_normalization_169", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_84", "trainable": true, "dtype": "float32"}, "name": "add_84", "inbound_nodes": [[["activation_169", 0, 0, {}], ["activation_168", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_168", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_168", "inbound_nodes": [[["add_84", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "encoder", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder", "inbound_nodes": [[["dropout_168", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_169", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_169", "inbound_nodes": [[["encoder", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_254", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_254", "inbound_nodes": [[["dropout_169", 0, 0, {}]]]}], "input_layers": [["input_85", 0, 0]], "output_layers": [["dense_254", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}