{"class_name": "Functional", "config": {"name": "functional_189", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_95"}, "name": "input_95", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_282", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_282", "inbound_nodes": [[["input_95", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_188", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_188", "inbound_nodes": [[["dense_282", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_188", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_188", "inbound_nodes": [[["batch_normalization_188", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_283", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_283", "inbound_nodes": [[["activation_188", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_189", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_189", "inbound_nodes": [[["dense_283", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_189", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_189", "inbound_nodes": [[["batch_normalization_189", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_94", "trainable": true, "dtype": "float32"}, "name": "add_94", "inbound_nodes": [[["activation_189", 0, 0, {}], ["activation_188", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_188", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_188", "inbound_nodes": [[["add_94", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "encoder", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder", "inbound_nodes": [[["dropout_188", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_189", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_189", "inbound_nodes": [[["encoder", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_284", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_284", "inbound_nodes": [[["dropout_189", 0, 0, {}]]]}], "input_layers": [["input_95", 0, 0]], "output_layers": [["dense_284", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}