{"class_name": "Functional", "config": {"name": "functional_57", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_29"}, "name": "input_29", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_100", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_100", "inbound_nodes": [[["input_29", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_101", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_101", "inbound_nodes": [[["dense_100", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "encoder", "trainable": true, "dtype": "float32", "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder", "inbound_nodes": [[["dense_101", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_102", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_102", "inbound_nodes": [[["encoder", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_16", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_16", "op": "ConcatV2", "input": ["dense_101/Relu", "dense_102/Relu", "concat_16/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 1}}, "name": "tf_op_layer_concat_16", "inbound_nodes": [[["dense_101", 0, 0, {}], ["dense_102", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_103", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_103", "inbound_nodes": [[["tf_op_layer_concat_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_17", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_17", "op": "ConcatV2", "input": ["dense_100/Relu", "dense_103/Relu", "concat_17/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 1}}, "name": "tf_op_layer_concat_17", "inbound_nodes": [[["dense_100", 0, 0, {}], ["dense_103", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_48", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_48", "inbound_nodes": [[["tf_op_layer_concat_17", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_104", "trainable": true, "dtype": "float32", "units": 9, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_104", "inbound_nodes": [[["dropout_48", 0, 0, {}]]]}], "input_layers": [["input_29", 0, 0]], "output_layers": [["dense_104", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}